tests/artilleryLoadTests/artillery-config.yml
config:
  target: "https://jsonplaceholder.typicode.com"
  phases:
    - duration: 30
      arrivalRate: 5
  payload:
    path: "./data.csv"
    fields:
      - title
      - body
      - userId
scenarios:
  - name: "Dynamic POST request"
    flow:
      - post:
          url: "/posts"
          json:
            title: "{{ title }}"
            body: "{{ body }}"
            userId: "{{ userId }}"